        IDENTIFICATION DIVISION.
        PROGRAM-ID. PROG07.
        ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
        SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        77 WRK-NOTA1              PIC IS  9(02)V99 VALUES ZEROS.
        77 WRK-NOTA2              PIC IS  9(02)V99 VALUES ZEROS.
        77 WRK-RESULTADO          PIC IS  9(02)V99 VALUES ZEROS.
        77 WRK-STATUS             PIC IS  X(20)   VALUES SPACES.
        77 WRK-NAMIN               PIC IS  9(02)V99 VALUE IS 6,02.
        77 WRK-NRMIN               PIC IS  9(02)V99 VALUE IS 4,02.
        PROCEDURE DIVISION.
        ACCEPT WRK-NOTA1 FROM CONSOLE.
        ACCEPT WRK-NOTA2 FROM CONSOLE.
        COMPUTE WRK-RESULTADO = (WRK-NOTA1 + WRK-NOTA2) / 2.
        IF WRK-RESULTADO >= WRK-NAMIN
          DISPLAY "VOCE ESTA APROVADO! SUA NOTA FOI DE: " WRK-RESULTADO
        ELSE
           IF WRK-RESULTADO >= WRK-NRMIN
                   DISPLAY "VOCE ESTA RECUPERACAO! SUA NOTA FOI DE: " WRK-RESULTADO
           ELSE
              DISPLAY "VOCE ESTA REPROVADO! SUA NOTA FOI DE: " WRK-RESULTADO " E A NOTA MINIMA PARA ESSA MATERIA E DE " WRK-NRMIN
           END-IF
        END-IF.
        STOP RUN.       
        