        IDENTIFICATION DIVISION.
        PROGRAM-ID. PROG02.
       *>*************************************
       *> ÁREA DE COMENTÁRIOS DO COBOL
       *> AUTOR = TAYLOR 
       *> OBJETIVO = IMPRIMIR UMA VARIAVEL 
       *>**************************************         
        ENVIRONMENT DIVISION. 
        DATA DIVISION.
       *> SEÇÃO PARA DECLARAR VARIAVEIS
        WORKING-STORAGE SECTION.
       *> AQUI DECLARAMOS A VARIAVEL NOME COMO BOA PRÁTICA COLOCAMOS O PREFIXO WRK
       *> O PIC SERIA REFERENTE A MÁSCARA (TIPO) E PRECISAMOS INICIALIZAR A VARIAVEL COM UM VALOR
       *> NESSE CASSO INICIALIZAMOS COM ESPAÇOS. NO CASO DE UMA NÚMERICA (9) PODERIA SER ZEROS.
        77 WRK-NOME PIC X(20) VALUES SPACES.
        PROCEDURE DIVISION.
       *> ACCEPT EQUIVALENTE AO INPUT() DO PYTHON FROM CONSOLE INDICA QUE A ENTRADA VEM DO CONSOLE
           ACCEPT WRK-NOME FROM CONSOLE.
       *> A CONCATENAÇÃO NO DISPLAY É FEITA PELO ESPAÇO DIFERENTE DE OUTRAS LINGUAGENS QUE USAM O +
           DISPLAY 'ENTRADA DE DADOS ' WRK-NOME.
       *> para tratar a variavel como uma corrente de caracteres uso o (p0:pn)
           DISPLAY 'ENTRADA DE DADOS ' WRK-NOME(9:10).
           STOP RUN.