        IDENTIFICATION DIVISION.
        PROGRAM-ID. PROG06.
        ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
        SPECIAL-NAMES.
            DECIMAL-POINT IS COMMA.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        77 WRK-NUM1               PIC IS 9(02) VALUES ZEROS.
        77 WRK-NUM2               PIC IS 9(02) VALUES ZEROS.
        77 WRK-RESUL              PIC IS S9(04) VALUES ZEROS.
        77 WRK-RESULTADO          PIC IS +zz9,99 VALUES ZEROS.
        PROCEDURE DIVISION.
        ACCEPT WRK-NUM1 FROM CONSOLE.
        ACCEPT WRK-NUM2 FROM CONSOLE.
        ADD WRK-NUM1 WRK-NUM2 GIVING WRK-RESUL.
        MOVE WRK-RESUL TO WRK-RESULTADO.
        DISPLAY WRK-RESULTADO.
        SUBTRACT WRK-NUM1    FROM WRK-NUM2 GIVING WRK-RESUL.
        MOVE WRK-RESUL TO WRK-RESULTADO.
        DISPLAY WRK-RESULTADO.
        STOP RUN.
            